# DataCamp: Interemediate SQL 
This course is a part of the many courses towards DataCamp's SQL Associate Certification. And this is my notes in this course, this will contain important functions and my answers to the practice exercises.<br>

<hr>

## Contents:
1. Lessons
   - Querying
   - Filtering
   - Null
   - Aggregate Functions
   - Arithmetic
   - Sorting
   - Grouping
   - Filtering Groups
2. Exercises
   - `WHERE IN`
   - `NULL`
   - Aliasing Functions
   - Grouping with `GROUP BY` Clause
   - `GROUP BY` with Multiple Fields
   - Answeing Business Questions
   - Filtering with `HAVING` clause

# Querying:

## 1. Using the ```COUNT()``` Function:
- ```COUNT()```: returns the number of records with values in a specific field.

In [2]:
-- Count the number of names and birthdates in the people table
SELECT COUNT(name), COUNT(birthdate) 
FROM people;

   company_id               company         city        country      continent
0         189  Otto Bock HealthCare   Duderstadt        Germany         Europe
1         848            Matrixport                   Singapore           Asia
2         556            Cloudinary  Santa Clara  United States  North America
3         999                 PLACE   Bellingham  United States  North America
4         396             candy.com     New York  United States  North America

### 1.1 Using ```*``` with ```COUNT()```

- The asterisk ```(*)``` in ```COUNT(*)``` counts the total number of records in a table.

## 2. Using `DISTINCT`

- The `DISTINCT` keyword selects unique values from a field.

In [ ]:
-- Select all unique languages in the films table
SELECT DISTINCT(language) 
FROM films;

### 2.1 Combining `COUNT()` with `DISTINCT`

Combine `COUNT()` and `DISTINCT` to count unique values in a field.

In [ ]:
-- Count the number of unique birthdates in the people table
SELECT COUNT(DISTINCT(birthdate)) AS unique_birthdates 
FROM people;
-- This will return fewer results

# Filtering:

## 1. Filtering Text in SQL

To search for patterns in text, SQL provides the following keywords:
1. `LIKE`
2. `NOT LIKE`
3. `IN`

### 1.1. Using `LIKE`

The `LIKE` operator is used with the `WHERE` clause to search for a pattern in a field.
- Wildcards:
    - `%` matches zero, one, or many characters.
    - `_` matches a single character.

In [ ]:
-- Find names that start with "Ad" followed by any number of characters
SELECT name 
FROM people 
WHERE name LIKE 'Ad%';

-- Find three-letter names starting with "E"
SELECT name 
FROM people 
WHERE name LIKE 'E__';

### 1.2. Using `NOT LIKE`

The `NOT LIKE` operator is used to find records that don't match the specified pattern.
**Note: This operation is case-sensitive.**

In [ ]:
-- Find names that don't start with "A."
SELECT name 
FROM people 
WHERE name NOT LIKE 'A%';

### 1.3. Using `WHERE` with `OR`

You can use multiple conditions in a `WHERE` clause by chaining `OR` conditions.

In [ ]:
-- Example: Selecting films released in 1920, 1930, or 1940
SELECT title 
FROM films 
WHERE release_year = 1920 OR release_year = 1930 OR release_year = 1940;

### 1.4. Using `IN`

The `IN` operator simplifies multiple `OR` conditions by specifying a list of values in parentheses.

In [ ]:
-- Find films released in 1920, 1930, or 1940 using IN
SELECT title 
FROM films 
WHERE release_year IN (1920, 1930, 1940);

### 1.5. Using `IN` with Text Fields

The `IN` operator can also be used with text fields to filter based on multiple values.

In [ ]:
-- Find films where the country is Germany or France
SELECT title 
FROM films 
WHERE country IN ('Germany', 'France');

# NULL

## 1. Using `IS NULL`

The `IS NULL` operator is used to filter records where the field has a NULL value.

In [ ]:
-- Find names with no recorded birthdate in the people table
SELECT name 
FROM people 
WHERE birthdate IS NULL;

## 2. Using `IS NOT NULL`

The `IS NOT NULL` operator filters records where the field has a non-NULL value.

In [ ]:
-- Count the number of people with recorded birthdates in the people table
SELECT COUNT(birthdate) AS count_non_null_birthdates 
FROM people 
WHERE birthdate IS NOT NULL;

## 3. `COUNT()` vs `IS NOT NULL`

There is no difference between using `COUNT()` on a field and using `COUNT()` with a `WHERE` clause and `IS NOT NULL`. Both count non-missing values.

In [ ]:
-- Count the non-missing birthdates in two ways
SELECT COUNT(birthdate) AS count_non_null_birthdates 
FROM people;

-- Equivalent query using IS NOT NULL
SELECT COUNT(*) 
FROM people 
WHERE birthdate IS NOT NULL;

# Aggregate Functions

## 1. Common Aggregate Functions

- `AVG()` – Finds the average value.
- `SUM()` – Returns the sum of all values.
- `MIN()` – Returns the minimum value.
- `MAX()` – Returns the maximum value.

In [ ]:
-- Find the average budget of films
SELECT AVG(budget) AS avg_budget 
FROM films;

-- Find the total budget of all films
SELECT SUM(budget) AS total_budget 
FROM films;

## 2. Finding Minimum and Maximum Values

- `MIN()` returns the lowest value in a column, while 
- `MAX()` returns the highest value.<br>
**These functions work on both numerical and non-numerical fields.**

In [ ]:
-- Find the minimum and maximum budget of films
SELECT MIN(budget) AS min_budget, MAX(budget) AS max_budget 
FROM films;

## 3. Using `WHERE` with Calculations

The `WHERE` clause is executed before the `SELECT` statement, allowing us to summarize subsets of data based on conditions.

In [ ]:
-- Find the average budget of movies made in 2010 or later
SELECT AVG(budget) AS avg_budget 
FROM films 
WHERE release_year >= 2010;

-- Find the total budget of movies made in 2010
SELECT SUM(budget) AS total_budget 
FROM films 
WHERE release_year = 2010;

## 4. Rounding Numerical Values with `ROUND()`

The `ROUND()` function allows us to round numerical values to a specified number of decimal places.
- Syntax: `ROUND(number, decimal_places)`
- If no second parameter is provided, `ROUND()` will round to the nearest whole number.

In [ ]:
-- Round the average budget of movies made in 2010 to 2 decimal places
SELECT ROUND(AVG(budget), 2) AS avg_budget_rounded 
FROM films 
WHERE release_year >= 2010;

### 4.4 Advanced `ROUND()` Usage

You can pass a negative number to the `ROUND()`
Example: `ROUND(budget, -5)` rounds to the nearest hundred thousand.

In [ ]:
-- Round the total budget to the nearest hundred thousand
SELECT ROUND(SUM(budget), -5) AS total_budget_rounded 
FROM films 
WHERE release_year = 2010;

# Arithmetic in SQL
We can use basic arithmetic operators in SQL for calculations within queries.

In [ ]:
-- Example of basic arithmetic in SQL
-- Subtracting the budget from the gross to calculate profit
SELECT gross - budget AS profit 
FROM films;

## 1. Aggregate Functions vs. Arithmetic

- **Aggregate Functions:** Operate vertically (e.g., `SUM()` adds all values in a column).<br>
- **Arithmetic:** Performs calculations horizontally across records (e.g.,` gross - budget` for each movie).

# Sorting

## Sorting Results in SQL

We use the `ORDER BY` clause to sort the results of a query based on one or more fields.

In [ ]:
-- Example: Sorting films by budget in ascending order
SELECT title, budget 
FROM films
ORDER BY budget ASC; -- by default it is ASC so no need to type ASC

### 1.1. Sorting by Multiple Fields

- SQL will first sort by the first field and use the second.
- You can also specify different sort orders for each field.

In [ ]:
-- Example: Sorting by Oscar wins and then by IMDb score in descending order
SELECT title, oscar_wins, imdb_score 
FROM films
ORDER BY oscar_wins DESC, imdb_score DESC;

-- Example: Sorting by birthdate in ascending order and name in descending order
SELECT name, birthdate 
FROM actors
ORDER BY birthdate ASC, name DESC;

### 1.2. Order of Execution

The order of execution in SQL is important to understand:<br>
`FROM` <br>
`WHERE` <br>
`SELECT` <br>
`ORDER BY` <br>
`LIMIT`

# Grouping

## 1. GROUP BY Clause
The `GROUP BY`clause is used to group rows sharing a property so that **aggregate functions can be applied to each group.**
- May shared property sila ng column o value. Imagine one column with different numbers but these numbers has the same propery in the other column, you can group them then.

In [ ]:
-- Example: Grouping by certification and calculating average duration
SELECT certification, AVG(duration) AS avg_duration
FROM films
GROUP BY certification;

### 1.2. Error Handling
- SQL will raise an error if you attempt to SELECT a field not included in the GROUP BY clause.<br>
**RESEARCH MORE INTO THIS, KIM**

In [ ]:
-- Example: This will raise an error
SELECT certification, title 
FROM films
GROUP BY certification;

-- Corrected query using aggregate function
SELECT certification, MAX(title) AS title
FROM films
GROUP BY certification;

ex: Cause magkakagulo-gulo umunti yung certification kasi grinoup mo na but yung count ng title the same but kapag MINAX() mo na maggiging isang title na lang for each group and therefore yung bilang is tama na.

### 1.3. GROUP BY Multiple Fields

In [ ]:
-- Example: Grouping by certification and language while counting titles
SELECT certification, language, COUNT(title) AS title_count
FROM films
GROUP BY certification, language;

# Filtering Groups
- To filter results of aggregate functions, we use the `HAVING` clause.

In [ ]:
-- Example: Using HAVING to filter years with more than ten films
SELECT release_year, COUNT(title) AS title_count
FROM films
GROUP BY release_year
HAVING title_count > 10;

## 1. HAVING Clause

- The `HAVING` clause is used for filtering groups created by `GROUP BY`.
- It allows us to filter based on the result of aggregate functions, unlike the `WHERE` clause.

In [ ]:
-- Example: This query is invalid since WHERE cannot filter aggregates
SELECT release_year, COUNT(title) AS title_count
FROM films
WHERE COUNT(title) > 10;  -- Invalid usage

### 1.1. Order of Execution

Understanding the order of execution is crucial:
`FROM` <br>
`WHERE` <br>
`GROUP BY` <br>
`HAVING` <br>
`SELECT` <br>
`ORDER BY` <br>
`LIMIT` <br>
The `WHERE` clause executes before `GROUP BY`, which is why we use `HAVING` for filtering groups.

In [ ]:
-- Example: Filtering average duration over two hours using HAVING
SELECT release_year, AVG(duration) AS avg_duration
FROM films
GROUP BY release_year
HAVING avg_duration > 120;  -- 120 minutes for two hours

<hr>

# Exercises:
These are not all the exercises. I just included those I think are complex.

### Exercise: WHERE IN
Within the films dataset:

In [ ]:
-- Ex 1: Find the title and release_year for all films over two hours in length released in 1990 and 2000
SELECT
    title,
    release_year
FROM films
WHERE 
    duration > 120 AND release_year IN (1990, 2000);

In [ ]:
-- Ex 3: Find the title, certification, and language all films certified NC-17 or R that are in English, Italian, or Greek
SELECT 
    title,
    certification,
    language
FROM films
WHERE
    certification IN ('R', 'NC-17') AND language IN ('English', 'Italian', 'Greek');

### Exercises with `NULL:`
From the film dataset:

In [ ]:
-- Ex 1: List all film titles with missing budgets
SELECT
    title AS no_budget_info
FROM
    films
WHERE 
    budget IS NULL;

In [ ]:
-- Ex 2: Count the number of films we have language data for
SELECT 
    COUNT(language) AS count_language_known
FROM films;

### Exercises: Aliasing with Functions
Within the films dataset:

In [ ]:
-- In the film dataset
-- Ex 1: Calculate the title and duration_hours from films
SELECT title, (duration / 60.0) AS duration_hours
FROM films;

### Exercises: Grouping with GROUP BY Clause
Within the films dataset:

In [ ]:
-- Ex 1: Select the release_year and count of films released in each year aliased as film_count.
SELECT
    release_year, COUNT(title) AS film_count
FROM
    films
GROUP BY
    release_year;

Here we grouped the film count for each release_year.

In [ ]:
-- Ex 2: Select the release_year and average duration aliased as avg_duration of all films, grouped by release_year
SELECT
    release_year, AVG(duration) AS avg_duration
FROM 
    films
GROUP BY
    release_year;

### Exercises: GROUP BY with multiple fields
Within the films dataset:

In [ ]:
-- Find the release_year, country, and max_budget, then group and order by release_year and country
SELECT
    release_year, 
    country,
    MAX(budget) AS max_budget
FROM films
GROUP BY 
    release_year, country;

Kim, ask why MAX(budget) works here, does not MAX() returns a single value from a column?

### Exercise: Answering Business Questions
In the real world, every SQL query starts with a business question. Then it is up to you to decide how to write the query that answers the question. Let's try this out.

Which release_year had the most language diversity?

In [ ]:
SELECT
    release_year, COUNT(DISTINCT language) AS Diverse
FROM films
GROUP BY
    release_year
ORDER BY
    Diverse DESC;
-- this returns 2006

### Exercise: Filtering with HAVING
within the films dataset:

Ex 1:
1. Select country from the films table, and get the distinct count of certification aliased as certification_count.
2. Group the results by country.
3. Filter the unique count of certifications to only results greater than 10.

In [ ]:
-- Ex 1: Select the country and distinct count of certification as certification_count
SELECT country, COUNT(DISTINCT certification) AS certification_count
FROM films
-- Group by country
GROUP BY country
-- Filter results to countries with more than 10 different certifications
HAVING COUNT(DISTINCT certification) > 10;